from shared.configs.keys_configs.json_key_config import JsonKeyConfig
from shared.configs.keys_configs.exceptional_keys import ExceptionalKeys


class TextContainer_KZ:
    # --- Қолданба атауы ---
    WINDOW_TITLE_DESCRIPTION = "электронды лазерлік ату машинасы"
    WINDOW_TITLE = "АТУ МАШИНАСЫ"
    VERSION = ExceptionalKeys.CURRENT_VERSION
    # --- Бас мәзір батырмасының деректері ---
    BUTTON_DATA = [
        {"text": "Жаттығулар,", "attr": "startButton"},
        {"text": "Параметрлер,", "attr": "settingsButton"},
        {"text": "Көмек", "attr": "helpButton"},
        {"text": "Шығу", "attr": "exitButton"},
    ]
    EXIT_BUTTON_TEXT = "Артқа"
    # --- Жаттығулар тізімі ---
    EXERCISE_TITLES = ["GTO стандарттары", "OBZR стандарттары", "спорттық ату"]
    # --- Модальдық терезе тақырыбы ---
    MODAL_TITLE = "Назар аударыңыз"
    MODAL_ERROR_TITLE = "Қате"
    MODAL_REGISTRATION_TITLE = "Атқышты қосу"
    MODAL_GROUP_REGISTRATION_TITLE = "Топ қосу"
    MODAL_LICENSE_TITLE = "Белсендіру"
    # --- Шығудағы хабар ---
    MODAL_MESSAGE_EXIT = "Шығу. Жалғастыру керек пе?"
    # --- Модальды терезе түймелері ---
    BUTTON_ACCEPT = "Қабылдау"
    BUTTON_SHOOTING_ACCEPT = "Ашу"
    BUTTON_TO_STAY = "Қалу"
    BUTTON_ONLINE_ACCEPT = "Онлайн белсендіру"
    BUTTON_CLOSE = "Жабу"
    BUTTON_OUT = "Шығу"
    BUTTON_ADD = "Қосу"
    ONLINE_ACCEPT_HINT = "Лицензия коды орнатылды"
    HINT_HEADER = "Кеңес"
    # --- Қате туралы ақпарат ---
    ERROR_EMPTY = "Шарт нөмірін енгізіңіз!"
    INFO_0 = "Шарт нөмірі жоқ!"
    INFO_2 = "Енгізілген деректер дұрыс емес!"
    INFO_3 = "Интернетке қосылым жоқ немесе сервер қол жетімсіз!\n Активация жасау алдында VPN өшірулі екенін тексеріңіз!"
    INFO_UNKNOWN = "Белгісіз жауап коды"
    ERROR = "Онлайн белсендендіру кезінде қате"
    # --- Модальдық терезе белгілері ---
    LABEL_SURNAME = "Тегі"
    LABEL_NAME = "Аты"
    LABEL_GROUP = "Топ / сынып"
    LABEL_CHOICE = "Топты таңдау"
    LABEL_DOCUMENT = "Шарт нөмірі"
    LABEL_LICENSE = "Лицензия кілті"
    LABEL_ACTIVATION = "Белсендіру кілті"
    LABEL_MESSAGE_ERROR = "Жарамсыз белсендіру кілті."
    LABEL_MESSAGE_EXIT = "Барлық талпыныстар таусылды!"
    LABEL_DESCRIPTION = """
        <p style='text-align:center;'>
        <b>Онлайн белсендіру.</b>
        Сәйкес өріске бағдарламалық жасақтаманы немесе онымен бірге жеткізілген жабдықты сатып алу шартының нөмірін енгізіңіз.
        «Онлайн белсендіру» батырмасын басыңыз, белсендіру кілтінің пайда болуын күтіңіз және «Қабылдау» батырмасымен форманы жабыңыз.
        
        <br><b style="color:red;">Ескерту!
        Офлайн режимде жұмыс істеу үшін әр 100 күн сайын интернетке қосылу мүмкіндігі бар бағдарлама арқылы лицензияны растау мақсатында бағдарламаны іске қосу қажет.</b>
        </p>"""
    CAM_HINT_TEXT = "Құрылғыдан табылған камералар тізімі."
    RESOLUTION_HINT_TEXT = """Ажыратымдылықтар тізімі: ажыратымдылық неғұрлым жоғары болса, ату дәлдігі де соғұрлым жоғары болады, алайда жұмыс істеу үшін көбірек ресурстар қажет.
        Бейне ағыны сапасын таңдау кезінде камера бейне ағыны экранының жоғарғы бұрышында көрсетілетін fps мәніне назар аударыңыз.
        Егер мән төмен болса (15 fps-тен аз), сапаны төмендеткен жөн. Тым төмен fps мәні бағдарламаның дұрыс жұмыс істемеуіне әкелуі мүмкін."""
    LABEL_URL_SITE_LINUX = "Өнімнің толық сипаттамасын алу үшін мына сілтеме арқылы веб-сайтқа кіре аласыз: https://algkod.com/"
    HELP_URL_SITE_LINUX = "Нұсқаулықпен егжей-тегжейлі танысу үшін сіз осы сілтеме бойынша сайтқа кіре аласыз: https://algkod.com/"
    # --- Параметрлер терезесінің тақырыбы ---
    SETTINGS_TITLE = "ОРНАТУ"
    # --- Параметрлердегі параметр атаулары ---
    SETTINGS_SLIDER = [
        {
            "text": "Лазерлік импульс ұзақтығы",
            "key": JsonKeyConfig.LASER_PULSE_DURATION[0],
            "min": 200,
            "max": 500,
            "dual": False,
            "hintText": """Лазер импульсінің ұзақтығы — атыстар арасындағы миллисекундпен өлшенетін кідіріс.
            Бұл параметр нақты қару түрі үшін өндіруші көрсеткен мәнге сәйкес орнатылады.
            Дұрыс емес мәнді орнату бағдарламаның дұрыс жұмыс істемеуіне әкелуі мүмкін.""",
        },
        {
            "text": "Лазер жарықтығы",
            "key": JsonKeyConfig.LASER_BRIGHTEST[0],
            "min": 0,
            "max": 255,
            "dual": False,
            "hintText": """Лазер жарықтығы — лазер жарықтығының деңгейі, бөлменің жарықтануына қарай орнатылады.
                Бөлмеде жарық жоғары болған жағдайда — лазер деңгейінің мәнін арттыру қажет, ал жарықтандыру әлсіз болса — азайту керек.""",
        },
        {
            "text": "Дыбыс",
            "key": JsonKeyConfig.SOUND_VALUE[0],
            "min": 0,
            "max": 100,
            "dual": False,
            "hintText": "Дыбыс деңгейі — қосымшадағы дыбыстардың қаттылық деңгейі.",
        },
        # {
        #     "text": "Қызыл сүзгі",
        #     "key": JsonKeyConfig.USE_RED_FILTER[0],
        #     "isSwitch": True,
        #     "default": True
        # },
        # {
        #     "text": "QR іздеу",
        #     "key": JsonKeyConfig.IS_QR_SEARCHER_USE[0],
        #     "isSwitch": True,
        #     "default": False
        # },
    ]
    # --- Калибрлеу көрсеткіштері ---
    SETTINGS_SWITCH = ["off", "on"]
    # --- Параметрлердегі белгі атауы ---
    SETTINGS_LABEL_VIDEO = "Бейне ағынының сапасы"
    SETTINGS_LABEL_CAMERA = "Бейне құрылғы"
    # --- Название лейбла громкости в настройках ---
    SETTINGS_LABEL_VOLUME_VIDEO = "дыбыс"
    # --- Параметрлердегі бейне сапасы ---
    SETTINGS_VIDEO = {
        "Төмен": JsonKeyConfig.LOW_VIDEO_RESOLUTION,
        "Орташа": JsonKeyConfig.MEDIUM_VIDEO_RESOLUTION,
        "Жоғары": JsonKeyConfig.HIGH_VIDEO_RESOLUTION
    }
    # - - - Егер камера болмаса ---
    SETTINGS_CAMERA = "қол жетімді камералар жоқ"
    # --- Анықтама терезесінің тақырыбы ---
    HELP_TITLE = "ҚЫЗЫҚТЫ КӨБІРЕК?"
    # --- Анықтама терезесінің мәтіні ---
    HELP_TEXT = "Қосымша ақпарат алу үшін біздің веб-сайтты қараңыз"
    HELP_FEEDBACK_TEXT = """
                    Әріптестер!
                    Бірге өнімімізді жақсартайық.
                    Біз өніміміздің сапасын үздіксіз жақсартуға
                    ұмтыламыз. Егер сіз бағдарламаның жұмысынан
                    қателерді, дәлсіздіктерді байқасаңыз немесе
                    оны дамыту бойынша ұсыныстарыңызбен
                    бөліскіңіз келсе, өтінеміз, қпаратты
                    техникалық қолдау қызметінің мекенжайына
                    жіберіңіз: support@algkod.com.
                    Ынтымақтастығыңыз үшін алдын ала алғыс
                    білдіреміз.
                        """
    # --- Анықтама терезесінің "қосымша ақпарат" түймесі ---
    HELP_BUTTON_MORE = "БІЗДІҢ САЙТ"
    # --- Анықтама терезесінің "нұсқаулық" түймесі ---
    HELP_BUTTON_GUIDE = "ПАЙДАЛАНУШЫ\nНҰСҚАУ"
    # --- Анықтама терезесінің "бағдарлама туралы" түймесі ---
    HELP_BUTTON_ABOUT = "БАҒДАРЛАМА ТУРАЛЫ"
    # --- Көмек терезесінің "жаңарту" батырмасы ---
    HELP_BUTTON_UPDATE = "ҚОЛДАНБАНЫ\nЖАҢАРТУ"
    # --- Жаттығу терезесінің "нәтижелері" түймесі ---
    EXERCISE_BUTTON_RESULT = "Нәтижелер"
    # --- Жаттығу терезесінің «келесі» түймесі ---
    EXERCISE_BUTTON_SHOOTING = "Келесі"
    # --- Жаттығу терезесінің бірінші жүгірткі тақырыбы ---
    EXERCISE_SLIDER_SHOOTER = "Атқыштар саны"
    # --- Жаттығу терезесінің екінші жүгірткі тақырыбы ---
    EXERCISE_SLIDER_SHOT = "Түсірілімдер саны"
    # --- Жаттығу терезесінің екінші жүгірткі тақырыбы ---
    EXERCISE_DESCRIPTION = "Бұл жерде жаттығу, нысана және ату туралы барлық маңызды ақпарат болады!"
    # --- Түсіру параметрлері терезесінің Shooter енгізу өрісі ---
    SHOOTING_SETTINGS_INPUT = "атушы"
    # --- Түсіру параметрлері терезесінің "параметрлері" түймесі ---
    SHOOTING_SETTINGS_BUTTON = "Параметрлер"
    # --- Түсіру параметрлері терезесінің "тіркеу" түймесі ---
    SHOOTING_REGISTRATION_BUTTON = "Тіркеу"
    # --- placeholder "Тегі" түсіру параметрлерінің терезелері ---
    SHOOTING_SURNAME_LABEL = "Тегі"
    # --- Түсіру параметрлері терезесінің "келесі" түймесі ---
    SHOOTING_START_BUTTON = "БАСТАУ"
    # --- Түсіру терезесінің "тоқтату" түймесі ---
    SHOOTING_STOP_BUTTON = "ТОҚТАТУ"
    # --- Суретке түсіру терезесі "Түсірілім кестесі:" кесте тақырыбы ---
    SHOOTING_TABLE_LABEL = "Түсірілім кестесі:"
    # --- Түсіру терезесі "Ашу" бірінші баған ---
    SHOOTING_COLUMN_1 = "Ашу"
    # --- Түсіру терезесі "екінші бағана" Түсіру терезесінің "ұпайы" ---
    SHOOTING_COLUMN_2 = "Ұпай"
    # --- Түсіру терезесінің "Уақыты" үшінші бағанасы ---
    SHOOTING_COLUMN_3 = "Уақыт"
    # --- Нәтижелер терезесінің атауы ---
    RESULT_TITLE = "ТҮСІРУ НӘТИЖЕЛЕРІ"
    # --- Нәтижелерді іздеу терезесі ---
    RESULT_PLACEHOLDER = "Іздеу..."
    # --- Нәтижелер терезесінің көрсеткілері ---
    RESULT_SHOOTER = "көрсеткілер"
    # --- Нәтижелер терезесінің топтары/сыныптары ---
    RESULT_GROUP = "Топтар/сыныптар"
    # --- Нәтиже терезесінің жаттығулары ---
    RESULT_EXERCISE = "Жаттығулар"
    # --- Нәтижелер терезесінің түймелері ---
    RESULT_BUTTON = {
        "ай": "month",
        "6 ай": "halfYear",
        "жыл": "year",
        "барлығы": None
    }
    # --- Нәтижелер терезесінің 1-кестесінің тақырыбы ---
    RESULT_TITLE_EXERCISE = "Орындалған жаттығулар кестесі"
    # --- Нәтижелер терезесінің 2-кестесінің тақырыбы ---
    RESULT_TITLE_SHOOTING = "Түсіру үстелі"
    # --- Нәтижелер терезесінің 1-кестесінің өрістері ---
    RESULT_HEADER_TABLE_EXERCISE = ["Күн", "Нәтиже", "Уақыт"]
    # --- Нәтижелер терезесінің 2-кестесінің өрістері ---
    RESULT_HEADER_TABLE_SHOOTING = ["Ауыс", "Ұпай", "Уақыт"]
    # --- Мәтін жүктелуде ---
    LOADING_TEXT = "Жүктелуде"
    # --- Шығарылған елі ---
    PRODUCING_COUNTRY = "Ресей 2025."
    # --- Жаттығудың мақсат түрі ---
    TYPE_EXERCISE = "ойын"
    # --- "PDF табылмады" қате туралы хабар ---
    MODAL_WARNING_PDF = "PDF файлын табу мүмкін емес."
    # --- "Өзгерістер күшіне енеді..." хабары ---
    MODAL_INFO_VIDEO = "Өзгерістер келесі камера үшін күшіне енеді."
    MODAL_INFO_REGISTRATION = "Түсірілімді бастау үшін тіркелу қажет."
    # - - - Сұрақ: бағдарламаны жаңарту керек пе ---
    MODAL_QUESTION_UPDATE = "бағдарламаны жаңарту қол жетімді.\пжалғастыру?"
    MODAL_INFO_UPDATE = "Жаңартулар жоқ."
    MODAL_INFO_1 = "Интернет жоқ немесе файлды жүктеу мүмкін емес."
    MODAL_INFO_2 = "Конфигуратор файлына кіруге тыйым салынады."
    MODAL_INFO_3 = "Жаңартуларды тексеру қатемен аяқталды."
    LOADING_COMPLETE_TEXT = "Жүктеу аяқталды. Енді бағдарлама қайта іске қосылады."
    CAM_ERROR_IMAGE_TEXT = "Camera unavailable"
    CAM_ERROR_MESSAGE_BOX_TEXT = "Таңдалған камера қолжетімсіз."
    PLAYER_MORE_TARGET_ERROR_TEXT = "Атушылар нысаналардан көп."
    GAME_TARGET_SOUND_ERROR_TEXT = "Бұл нысана үшін дыбысты қосу қажет."
    OPEN_REPORTS_DIR_TEXT = "Ату аяқталды. Есептер қалтасын ашу керек пе?"
    OPEN_REPORTS_FILE_TEXT = "Құжат ашылып жатыр. Ол басқа терезеде болуы мүмкін."
    TARGET_HINT = "Нысананы үлкейту үшін оны басыңыз"

    TARGET_LONG_MESSAGE = "Нысана {0} тым алыс."
    TARGET_SHORT_MESSAGE = "Нысана {0} тым жақын."
    TARGET_IS_STATIC_MESSAGE = "Нысана {0} орнатылды."

    EXIT_MESSAGES = ["Шығу", "Қосымша жабылады! {0}"]
    PERMISSION_MESSAGES = ["Пайдаланушы құқықтары",
                                      "Қажетті компоненттерді орнату үшін әкімші (администратор) құқықтары талап етіледі, компоненттерді орнатуды орындау керек пе?"]
    LIB_QUESTION_MESSAGES = ["Орнатушы",
                                        "Таңдалған компоненттер орнатылсын ба?\n {0} \n Назар аударыңыз, VPN қосулы болған жағдайда "
                                        "компоненттерді жүктеп алу мүмкін болмауы мүмкін! Сондай-ақ, егер қосымшаға әкімші құқықтарын "
                                        "бергіңіз келмесе, қажетті компоненттерді өзіңіз дербес орната аласыз."]
    SUCCESS_MESSAGES = ["Орнатушы", "Компоненттер сәтті орнатылды!"]